#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Ответственный = Пользователи.ТекущийПользователь(); 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
			|	РеализацияТоваровУслуг.Организация КАК Организация,
			|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
			|	РеализацияТоваровУслуг.Договор КАК Договор,
			|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
			|	РеализацияТоваровУслуг.Товары.(
			|		Номенклатура КАК Номенклатура,
			|		Количество КАК Количество) КАК Товары
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Договор = ВыборкаДетальныеЗаписи.Договор;
		    Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
		    Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		    Организация = ВыборкаДетальныеЗаписи.Организация;
		    Основание = ВыборкаДетальныеЗаписи.Ссылка;
		    
		    ВыборкаНоменклатуры = ВыборкаДетальныеЗаписи.Товары.Выбрать();	
		    Пока ВыборкаНоменклатуры.Следующий() Цикл 
			   НоваяСтрока = Товары.Добавить();
			   НоваяСтрока.Количество = ВыборкаНоменклатуры.Количество;
			   НоваяСтрока.Номенклатура = ВыборкаНоменклатуры.Номенклатура;
		    КонецЦикла;
		КонецЦикла;

	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли